Repository: nvdaaddons/debugHelper
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: bg, de, es, hr, pt_br, sk, sl

source: -- MARK {0} --
bg: -- МАРКЕР {0} --
de: -- Markierung {0} --
es: -- MARCA {0} --
hr: -- OZNAKA {0} --
pt_br: -- MARCA {0} --
sk: -- ZNAČKA {0} --
sl: -- OZNAČBA {0} --

source: &Debug Helper...
bg: Помощник при отстраняване на &грешки...
de: &Debug-Helfer...
es: Ayudante de &depuración...
hr: &Pomoćnik za uklanjanje grešaka …
pt_br: Ajudante de &Depuração...
sk: &Pomocník pre ladenie...
sl: &Pomočnik pri Razhroščevanju...

source: Debug Helper add-on settings
bg: Настройки на добавката "Помощник при отстраняване на грешки"
de: Debug-Helfer-Einstellungen
es: Opciones del complemento ayudante de depuración
hr: Postavke za dodatak „Pomoćnik za uklanjanje grešaka”
pt_br: Configurações do complemento Ajudante de Depuração
sk: Nastavenie doplnku Debug Helper
sl: Nastavitve dodatka Pomočnik pri razhroščevanju

source: Logging mark {0}!
bg: Протоколиран е маркер {0}!
de: Protokollierungsmarkierung {0}!
es: ¡Grabando marca {0}!
hr: Zapisivanje oznake {0}!
pt_br: Gravação em log da marca {0}!
sk: Zaznamenávacia značka {0}!
sl: Zabeležena označba {0}!

source: Inserts a mark line in the log to aid in debugging
bg: Вмъква маркировъчен ред в протокола, с цел помощ при отстраняването на грешки
de: Fügt eine Markierungslinie in das Protokoll ein, um das Debuggen zu erleichtern.
es: Inserta una línea de marca en el registro para ayudar en la depuración
hr: Umeće redak s oznakom u log zapis kao pomoć pri uklanjanju grešaka
pt_br: Insere uma linha de marca no log para ajudar na depuração
sk: Vloží značku do protokolu, ktorá uľahčí ladenie
sl: Vstavi vrstico z označbo v dnevnik kot pomoč pri razhroščevanju

source: Debug Helper
bg: Помощник при отстраняване на грешки
de: Debug-Helfer
es: Ayudante de Depuración
hr: Pomoćnik za uklanjanje grešaka
pt_br: Ajudante de Depuração
sk: Pomocník pre ladenie
sl: Pomočinik pri Razhroščevanju

source: Number of blank lines before each mark (can make marks easier to find with fast arrowing)
bg: Брой празни редове преди всеки маркер (може да улесни намирането на маркери при бързо обхождане със стрелките)
de: Anzahl der Leerzeilen vor jeder Markierung (kann das Auffinden von Markierungen durch schnelle Navigation mit den Pfeiltasten erleichtern)
es: Cantidad de líneas antes de cada marca (facilita la búsqueda de marcas desplazándose rápidamente con las flechas)
hr: Broj praznih redaka prije svake oznake (može olakšati pronalaženje oznaka pomoću brze upotrebe strelica)
pt_br: Número de linhas em branco antes de cada marca (pode ser mais fácil encontrar as marcas movendo-se rapidamente com setas)
sk: Počet prázdnych riadkov pred každou značkou (vďaka rýchlemu smerovaniu šípky je možné značky ľahšie nájsť)
sl: Število praznih vrstic pred vsako označbo (zaradi tega je možno lažje najti označbe s hitrim pritiskanjem puščic)

source: Number of blank lines after each mark
bg: Брой празни редове след всеки маркер
de: Anzahl der Leerzeilen nach jeder Markierung
es: Cantidad de líneas en blanco después de cada marca
hr: Broj praznih redaka nakon svake oznake
pt_br: Número de linhas em branco após cada marca
sk: Počet prázdnych riadkov za každou značkou
sl: Število praznih vrstic po vsaki označbi

source: Debug Helper Settings
bg: Настройки на помощника за отстраняване на грешки
de: Debug-Helfer-Einstellungen
es: Opciones del ayudante de depuración
hr: Postavke pomoćnika za uklanjanje grešaka
pt_br: Configurações do Ajudante de Depuração
sk: Nastavenie Debug Helper
sl: Nastavitve Pomočnika pri Rzhroščevanju

source: Makes debugging tasks easier for developers and others trying to solve problems. Inserts sequentially numbered mark lines in the log when you press NVDA+shift+F1, to make it easy to search for things, by "tagging" them. Contact me if you find it useful, and especially with feature ideas.
bg: Улеснява задачите по отстраняване на грешки за програмисти и други, които се опитват да решат проблеми. Вмъква последователно номерирани линии за маркиране в протокола, когато натиснете NVDA+Shift+F1, за да улесни търсенето на неща, като ги "отбелязва". Свържете се с мен ако ви върши работа, особено с идеи за нови функции.
de: Erleichtert das Debuggen von Aufgaben für Entwickler und andere, die versuchen, Probleme zu lösen. Fügt beim Drücken von NVDA+Umschalt+F1 fortlaufend nummerierte Markierungszeilen in das Protokoll ein, um die Suche nach Dingen durch "Tagging" zu erleichtern. Kontaktieren Sie den Autor dieser Erweiterung, wenn Sie es nützlich finden und vor allem mit Feature-Ideen.
es: Facilita las tareas de depuración a los desarrolladores y a todo aquel que intenta resolver problemas. Inserta secuencialmente líneas de marca numeradas en el registro al pulsar NVDA+shift+f1 para facilitar la búsqueda de elementos "etiquetándolos". Contacta conmigo si lo encuentras útil, y especialmente si se te ocurren nuevas funciones.
hr: Programerima i drugima koji pokušavaju riješiti probleme olakšava uklanjanje grešaka. U log zapis umeće retke s numeriranim oznakama kad se pritisne NVDA+šift+F1. Tim „označavanjem” se olakšava traženje određenih stvari. Kontaktiraj me ako smatraš da je dodatak koristan, a naročito, ako imaš ideje o novim funkcijama.
pt_br: Facilita as tarefas de depuração para desenvolvedores e outras pessoas que tentam resolver problemas. Insere linhas de marcas numeradas seqüencialmente no log quando você pressiona NVDA+shift+F1, para facilitar a pesquisa de itens, "identificando" eles. Entre em contato comigo se achar útil, e principalmente com ideias de recursos.
sk: Zjednodušuje ladenie úloh vývojárom a ostatným, ktorí sa snažia vyriešiť problémy. Po stlačení NVDA + shift + F1 vloží do denníka postupne očíslované riadky, aby sa uľahčilo vyhľadávanie vecí ich označením. Kontaktujte autora, ak to považuje za užitočné, najmä s nápadmi na funkcie.
sl: Olajšuje opravila pri razhroščevanju razvijalcem in drugim, ki poskušajo reševati težave. Vstavlja zaporedno oštevilčene vrstice z označbami v dnevniku, ko pritiskate NVDA+shift+F1 ali drugo po meri določeno kretnjo, za lažje iskanje stvari z "označevanjem" njih. Stopite v stik z mano, će je dodatek za vas uporaben in absolutno ob idejah za nove zmožnosti.
